app/controllers/students_controller.rb

  def set_stude
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]